[{"accession":"catalyze","name":"catalyze","definition":"enzymes that facilitates the movement of transposons"},{"accession":"confers_resistance_to","name":"confers_resistance_to","definition":"A relationship ontology term in which the subject (e.g. a gene family) confers or contributes to antibiotic resistance to the object (e.g. a drug class). It is a qualitative measure of antibiotic resistance, based on an experiment illustrating elevated MIC even outside of a clinical setting."},{"accession":"confers_resistance_to_drug","name":"confers_resistance_to_drug","definition":"A relationship ontology term in which the subject (usually an enzyme, protein or other gene product) confers or contributes to clinically relevant resistance to a specific antibiotic drug."},{"accession":"derives_from","name":"derives_from","definition":"A relationship ontology term in which the subject has its origins from the object (paraphrased from Relationship Ontology)."},{"accession":"has_part","name":"has_part","definition":"A core relation that holds between a whole and its part. The subject has_part object. (paraphrased from Relationship Ontology)"},{"accession":"is_a","name":"is_a","definition":"An axiomatic relationship ontology term in which the subject is placed into a higher order classification (paraphrased from Relationship Ontology)."},{"accession":"participates_in","name":"participates_in","definition":"A relation between a continuant and a process, in which the continuant is somehow involved in the process, e.g., this input material (or this output material) participates in this process."},{"accession":"part_of","name":"part_of","definition":"A relationship ontology term in which the subject is but part of the object (paraphrased from Relationship Ontology)."},{"accession":"regulates","name":"regulates","definition":"A relationship ontology term in which the subject regulates expression of the object."},{"accession":"relationship","name":"relationship","definition":"A relationship between two ontology terms."},{"accession":"represses","name":"represses","definition":"A relationship between a transcriptional regulator and a gene or gene product, in which the regulator is plays a negative role in the transcriptional process."},{"accession":"targeted_by","name":"targeted_by","definition":"A relationship ontology term in which the subject is targeted by the object (usually a class of antibiotics)."},{"accession":"targeted_by_drug","name":"targeted_by_drug","definition":"A relationship ontology term in which the subject is targeted by a specific antibiotic."}]